<a href="https://colab.research.google.com/github/joohoshin/MLDL_Basic/blob/master/5_1_%EC%A1%B0%EA%B1%B4_%EA%B2%80%EC%83%89.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 조건 검색
* pandas에서는 특정 조건을 만족하는 행만 쉽게 추출할 수 있습니다

In [ ]:
from google.colab import drive
drive.mount('/g')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
4/4AFWYR9CokUg35I_Emq6LoABqGkHvk5Ex5egKTWVd6uc5JtfOw-dsc0
Mounted at /g

In [ ]:
import pandas as pd

# 지난 강의에서 만든 성적데이터를 불러와 봅시다
grade = pd.read_csv('/g/My Drive/ML_DL_202002/grade.csv', index_col = 'id') # 인덱스 컬럼 지정

In [ ]:
grade

       머신러닝  딥러닝  파이썬
id
12250    70   71   48
18711    74   67   93
13660    90   58   74
14831    82   76   69
18425    70   55   43
...     ...  ...  ...
10170    98   55   60
12298    87   75   40
15967    71   51   48
15749    94   84   76
18402    81   62   54

[100 rows x 3 columns]

* df.query()를 사용해서 특정 조건만 추출할 수 있습니다

In [ ]:
머신러닝A = grade.query('머신러닝>=90')

In [ ]:
머신러닝A

       머신러닝  딥러닝  파이썬
id
13660    90   58   74
12489    97   97   46
19010    97   60   91
14734   100   99   79
12101    92   50   78
11680    95   50   52
13992    94   86   43
18386    92   76   70
12154    99   69   83
14047    95   51   91
10142    90   99   66
17842    93   87   85
16798    90   50   72
12601    91   85   77
18908    92   51   56
11994    95   77   80
10850    99   78   93
11899   100   58   72
19380    91  100   78
16389    93   92   77
15814    91   60   58
10266    93   54   41
18713    94   89   89
19427   100   74   50
12529    95   51   44
12074    90   95   80
18758    90  100   63
18655    93   89   85
16246    92   80   84
10170    98   55   60
15749    94   84   76

In [ ]:
print('머신러닝 A 학점 학생수: ',len(머신러닝A), '명')

머신러닝 A 학점 학생수:  31 명

* &, and 나 |, or를 사용해서 다양한 조건을 검색할 수 있습니다.

In [ ]:
# 3과목 모두 80점 이상인 학생 추출
point = 85

#all = grade.query('머신러닝>=@point and 딥러닝 >=@point and 파이썬 >=@point')
all = grade.query('머신러닝>=@point & 딥러닝 >=@point & 파이썬 >=@point')
all

       머신러닝  딥러닝  파이썬
id
11358    87   95   87
17842    93   87   85
18713    94   89   89
18655    93   89   85

In [ ]:
# 3과목 중 1과목 이상 70점 미만인 학생 추출
point = 70

#all = grade.query('머신러닝 < @point or 딥러닝 < @point or 파이썬 < @point')
all = grade.query('머신러닝 < @point | 딥러닝 < @point | 파이썬 < @point')
all

       머신러닝  딥러닝  파이썬
id
12250    70   71   48
18711    74   67   93
13660    90   58   74
14831    82   76   69
18425    70   55   43
...     ...  ...  ...
15794    73   72   65
10170    98   55   60
12298    87   75   40
15967    71   51   48
18402    81   62   54

[69 rows x 3 columns]

# 연산하기



*   컬럼명을 바꿔봅시다
*   전체를 바꿀때는 df.columns = 컬럼명 리스트 (df는 dataframe 변수명을 넣습니다)
*   부분만 바꿀때는 df = df.rename(columns={'이전컬럼명':'새로운컬럼명',...} 바꾸고 싶은 컬럼이름을 딕셔너리로 넣어줍니다.

In [ ]:
grade.columns = ['퀴즈', '중간고사', '기말고사']

In [ ]:
grade = grade.rename(columns = {'중간고사':'중간평가', '기말고사':'기말평가'})

In [ ]:
grade.head()

       퀴즈  중간평가  기말평가
id
12250  70    71    48
18711  74    67    93
13660  90    58    74
14831  82    76    69
18425  70    55    43

* 퀴즈 20% 중간 30% 기말 50% 의 비중으로 성적 합계를 계산하는 것으로 가정합시다
* assign() 함수에 식을 적을 수 있습니다 .
* df['column']은 df.column과 같습니다.

In [ ]:
grade = grade.assign(합계 = grade.퀴즈 * 0.2 + grade.중간평가 * 0.3 + grade.기말평가 * 0.5)

In [ ]:
grade

       퀴즈  중간평가  기말평가    합계
id
12250  70    71    48  59.3
18711  74    67    93  81.4
13660  90    58    74  72.4
14831  82    76    69  73.7
18425  70    55    43  52.0
...    ..   ...   ...   ...
10170  98    55    60  66.1
12298  87    75    40  59.9
15967  71    51    48  53.5
15749  94    84    76  82.0
18402  81    62    54  61.8

[100 rows x 4 columns]

* 성적순으로 정렬해봅시다. 
* sort_values() 함수를 사용합니다. 기본값은 오름차순, 내림차순은 옵션에 ascending= False를 넣어줘야 함

In [ ]:
grade_sort = grade.sort_values('합계', ascending = False)

In [ ]:
grade_sort.head()

        퀴즈  중간평가  기말평가    합계
id
18713   94    89    89  90.0
10850   99    78    93  89.7
10776   73    96    92  89.4
11358   87    95    87  89.4
14734  100    99    79  89.2

* 특정 컬럼만 선택하기
* filter() 함수를 사용합니다. 입력값에 가져오고 싶은 컬럼명을 리스트 형태로 입력합니다

In [ ]:
grade_final = grade_sort.filter(['기말평가','합계'])

In [ ]:
grade_final.head()

       기말평가    합계
id
18713    89  90.0
10850    93  89.7
10776    92  89.4
11358    87  89.4
14734    79  89.2